# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [7]:
series1 = pd.Series(np.random.randint(1,4,size = 100))
series2 = pd.Series(np.random.randint(1,3,size = 100))
series3 = pd.Series(np.random.randint(10000,30000,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [11]:
df = pd.concat([series1, series2,series3],axis=1)
df

    0  1      2
0   2  1  25347
1   3  2  10891
2   1  2  28715
3   3  2  20195
4   2  2  20487
.. .. ..    ...
95  1  2  16635
96  2  2  11295
97  1  1  28516
98  1  1  20544
99  2  2  22252

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [12]:
df.columns=['bedrs','bathrs','price_sqr_meter']

In [13]:
df

    bedrs  bathrs  price_sqr_meter
0       2       1            25347
1       3       2            10891
2       1       2            28715
3       3       2            20195
4       2       2            20487
..    ...     ...              ...
95      1       2            16635
96      2       2            11295
97      1       1            28516
98      1       1            20544
99      2       2            22252

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [18]:
newdf = pd.DataFrame({'bigcolumn': df.apply(lambda row: ''.join(map(str, row)), axis=1)})
newdf

   bigcolumn
0    2125347
1    3210891
2    1228715
3    3220195
4    2220487
..       ...
95   1216635
96   2211295
97   1128516
98   1120544
99   2222252

[100 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [20]:
True

True

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [19]:
newdf = newdf.reindex(range(300))
newdf

    bigcolumn
0     2125347
1     3210891
2     1228715
3     3220195
4     2220487
..        ...
295       NaN
296       NaN
297       NaN
298       NaN
299       NaN

[300 rows x 1 columns]